### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. 

It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [2]:
pip install pandas

Requirement already satisfied: pandas in d:\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in d:\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in d:\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in d:\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

### Series
A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

In [4]:
import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
## Create a Series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

### DataFrame
2D - have multiple rows and columns

In [14]:
## create a Dataframe from a dictionary of list
data={
    'Name':['Hafsa','Hoorain','Annural'],
    'Age':[22,25,27],
    'City':['Islamabad','Swl','Hunza']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age       City
0    Hafsa   22  Islamabad
1  Hoorain   25        Swl
2  Annural   27      Hunza
<class 'pandas.core.frame.DataFrame'>

In [15]:
## Create a Data frame from a List of Dictionaries
data=[
    {'Name':'Hafsa','Age':22,'City':'Islamabad'},
    {'Name':'Maryam','Age':24,'City':'Swl'},
    {'Name':'Hoorain','Age':27,'City':'Hunza'},
    {'Name':'Annural','Age':29,'City':'Gilgit'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age       City
0    Hafsa   22  Islamabad
1   Maryam   24        Swl
2  Hoorain   27      Hunza
3  Annural   29     Gilgit
<class 'pandas.core.frame.DataFrame'>

In [9]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [10]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [16]:
## Accessing Data From Dataframe
df

      Name  Age       City
0    Hafsa   22  Islamabad
1   Maryam   24        Swl
2  Hoorain   27      Hunza
3  Annural   29     Gilgit

In [17]:
df['Name'] # if we pick 1 column it actually becomes a series

0      Hafsa
1     Maryam
2    Hoorain
3    Annural
Name: Name, dtype: object

In [18]:
df.loc[0] # pick up my 0th row 
# loc operation - row index

Name        Hafsa
Age            22
City    Islamabad
Name: 0, dtype: object

In [19]:
df.iloc[0]
# index location - column index

Name        Hafsa
Age            22
City    Islamabad
Name: 0, dtype: object

In [20]:
df

      Name  Age       City
0    Hafsa   22  Islamabad
1   Maryam   24        Swl
2  Hoorain   27      Hunza
3  Annural   29     Gilgit

In [21]:
## Accessing a specified element
df.at[2,'Age']

np.int64(27)

In [22]:
df.at[2,'Name']

'Hoorain'

In [23]:
## Accessing a specified element using iat
df.iat[2,2]

'Hunza'

In [24]:
df

      Name  Age       City
0    Hafsa   22  Islamabad
1   Maryam   24        Swl
2  Hoorain   27      Hunza
3  Annural   29     Gilgit

In [25]:
## Data Manipulation with Dataframe
df

      Name  Age       City
0    Hafsa   22  Islamabad
1   Maryam   24        Swl
2  Hoorain   27      Hunza
3  Annural   29     Gilgit

In [27]:
## Adding a column
df['Salary']=[50000,60000,70000,90000]
df

      Name  Age       City  Salary
0    Hafsa   22  Islamabad   50000
1   Maryam   24        Swl   60000
2  Hoorain   27      Hunza   70000
3  Annural   29     Gilgit   90000

In [28]:
## Remove a column
df.drop('Salary',axis=1,inplace=True)

In [29]:
df

      Name  Age       City
0    Hafsa   22  Islamabad
1   Maryam   24        Swl
2  Hoorain   27      Hunza
3  Annural   29     Gilgit

In [30]:
## Add age to column
df['Age']=df['Age']+1
df

      Name  Age       City
0    Hafsa   23  Islamabad
1   Maryam   25        Swl
2  Hoorain   28      Hunza
3  Annural   30     Gilgit

In [31]:
df.drop(0,inplace=True)

In [32]:
df

      Name  Age    City
1   Maryam   25     Swl
2  Hoorain   28   Hunza
3  Annural   30  Gilgit

In [33]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [34]:
# Display data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [35]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000